### inthis notebook we cover datatype broadcasting technique
##           don,t disturb thid file

In [1]:
import pandas as pd
import numpy as np

In [48]:
data={"string_col":['1','2','3','4','5'],
     "int_float":[1,3,2,2.2,3],
     "int_col":[4,4,64,43,34],
     "mising_col":[1,3,4,5,np.nan],
     "mixed_col":["a","-2",3,4,3],
     "price":["$1,500.00","$2,436.45","$9,58.99","$1,798.00","$5,456.25"]}

In [3]:
type(data)

dict

In [49]:
data=pd.DataFrame(data=data)
data

  string_col  int_float  int_col  mising_col mixed_col      price
0          1        1.0        4         1.0         a  $1,500.00
1          2        3.0        4         3.0        -2  $2,436.45
2          3        2.0       64         4.0         3   $9,58.99
3          4        2.2       43         5.0         4  $1,798.00
4          5        3.0       34         NaN         3  $5,456.25

In [5]:
data.dtypes

string_col     object
int_float     float64
int_col         int64
mising_col    float64
mixed_col      object
price          object
dtype: object

In [6]:
data['string_col']=data['string_col'].astype(int)
data['string_col'].dtypes

dtype('int32')

In [7]:
data.head(3)

   string_col  int_float  int_col  mising_col mixed_col      price
0           1        1.0        4         1.0         a  $1,500.00
1           2        3.0        4         3.0        -2  $2,436.45
2           3        2.0       64         4.0         3    $958.99

In [8]:
data['string_col']=data['string_col'].astype(float)
data['string_col'].dtypes

dtype('float64')

In [9]:
data["string_col"]

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: string_col, dtype: float64

### and now i will deal with the int_float column

In [10]:
data['int_float'].dtypes

dtype('float64')

In [11]:
data['int_float']=data['int_float'].astype(int)
data['int_float'].dtypes

dtype('int32')

In [12]:
data.head()

   string_col  int_float  int_col  mising_col mixed_col      price
0         1.0          1        4         1.0         a  $1,500.00
1         2.0          3        4         3.0        -2  $2,436.45
2         3.0          2       64         4.0         3    $958.99
3         4.0          2       43         5.0         4  $1,798.00
4         5.0          3       34         NaN         3  $5,456.25

In [13]:
data.dtypes

string_col    float64
int_float       int32
int_col         int64
mising_col    float64
mixed_col      object
price          object
dtype: object

In [14]:
data['int_float']=data['int_float'].astype(float)
data['int_float'].dtypes

dtype('float64')

In [15]:
data.head()

   string_col  int_float  int_col  mising_col mixed_col      price
0         1.0        1.0        4         1.0         a  $1,500.00
1         2.0        3.0        4         3.0        -2  $2,436.45
2         3.0        2.0       64         4.0         3    $958.99
3         4.0        2.0       43         5.0         4  $1,798.00
4         5.0        3.0       34         NaN         3  $5,456.25

### and i will deal with the int_col to string column

In [16]:
data['int_col']=data['int_col'].astype(str)
data['int_col'][2]

'64'

In [17]:
data['int_col']=data['int_col'].astype(int)
data['int_col'][2]

64

### now , i will deal with the missing column
#### here rember that , a mising value dos,nt convert into the integer value
#### but if you want to convert than u can convert your mising value atribute to the float
#### if you need convert your mising value column in int than fill null value

In [18]:
data['mising_col']

0    1.0
1    3.0
2    4.0
3    5.0
4    NaN
Name: mising_col, dtype: float64

In [19]:
data['mising_col']=data['mising_col'].astype(float)
data['mising_col'].dtypes

dtype('float64')

In [20]:
data['mising_col']=data['mising_col'].astype(int)  #it is not possible bcz here mising value
data['mising_col'].dtypes

ValueError: Cannot convert non-finite values (NA or inf) to integer

In [22]:
data

   string_col  int_float  int_col  mising_col mixed_col      price
0         1.0        1.0        4         1.0         a  $1,500.00
1         2.0        3.0        4         3.0        -2  $2,436.45
2         3.0        2.0       64         4.0         3    $958.99
3         4.0        2.0       43         5.0         4  $1,798.00
4         5.0        3.0       34         NaN         3  $5,456.25

In [23]:
data['mising_col']=pd.to_numeric(data.mising_col)
data.mising_col

#here result will be prsent in the float64 and nun value present alse here
# if you want to change into int then remeber some point to keep in mind
# first "Int64" in string will have to parse and after the to_numeric
# bcz only one thid data typ can change the mising value present in float datatype

0    1.0
1    3.0
2    4.0
3    5.0
4    NaN
Name: mising_col, dtype: float64

In [24]:
data['mising_col']=pd.to_numeric(data.mising_col).astype('Int64')    #this syntex is important for convert to mising value into Int64
data.mising_col

0       1
1       3
2       4
3       5
4    <NA>
Name: mising_col, dtype: Int64

### and we will remove the null value in the mising_col after that we will change the dattype in integer

In [25]:
data

   string_col  int_float  int_col  mising_col mixed_col      price
0         1.0        1.0        4           1         a  $1,500.00
1         2.0        3.0        4           3        -2  $2,436.45
2         3.0        2.0       64           4         3    $958.99
3         4.0        2.0       43           5         4  $1,798.00
4         5.0        3.0       34        <NA>         3  $5,456.25

In [26]:
data['mising_col']=data['mising_col'].fillna(0)

In [27]:
data

   string_col  int_float  int_col  mising_col mixed_col      price
0         1.0        1.0        4           1         a  $1,500.00
1         2.0        3.0        4           3        -2  $2,436.45
2         3.0        2.0       64           4         3    $958.99
3         4.0        2.0       43           5         4  $1,798.00
4         5.0        3.0       34           0         3  $5,456.25

In [28]:
data.mising_col.dtypes

Int64Dtype()

### let,s go to the mixed_col for deal the that datatype

In [29]:
data.mixed_col.dtypes

dtype('O')

In [30]:
data['mixed_col'].map(str)[3]          #and now this is string datatype

'4'

In [31]:
dist={'a':'5'}        # this is not working but its all right my friend i have another idea
# just i have return a null vlue ,and we can deal with the null value

In [32]:
def chechfunc(x):
    if x=="a":
        dist[x]
    else:
        return x

In [33]:
data['mixed_col'].map(chechfunc)

0    None
1      -2
2       3
3       4
4       3
Name: mixed_col, dtype: object

In [34]:
data.mixed_col.dtypes
#and this is float64 and we want into int

dtype('O')

In [35]:
data['mixed_col']=pd.to_numeric(data.mixed_col,errors="coerce").fillna(0).astype(int)
data

   string_col  int_float  int_col  mising_col  mixed_col      price
0         1.0        1.0        4           1          0  $1,500.00
1         2.0        3.0        4           3         -2  $2,436.45
2         3.0        2.0       64           4          3    $958.99
3         4.0        2.0       43           5          4  $1,798.00
4         5.0        3.0       34           0          3  $5,456.25

In [36]:
data

   string_col  int_float  int_col  mising_col  mixed_col      price
0         1.0        1.0        4           1          0  $1,500.00
1         2.0        3.0        4           3         -2  $2,436.45
2         3.0        2.0       64           4          3    $958.99
3         4.0        2.0       43           5          4  $1,798.00
4         5.0        3.0       34           0          3  $5,456.25

### and it is my last column that are price this
## atribute is "o" typ and we want to change dtype as well as
## formating this string

In [37]:
data['price']=data['price'].str.replace("$",'')
data['price'].dtypes

<ipython-input-37-2998f52a6976>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  data['price']=data['price'].str.replace("$",'')

dtype('O')

In [45]:
data

   string_col  int_float  int_col  mising_col  mixed_col     price
0         1.0        1.0        4           1          0  1,500.00
1         2.0        3.0        4           3         -2  2,436.45
2         3.0        2.0       64           4          3    958.99
3         4.0        2.0       43           5          4  1,798.00
4         5.0        3.0       34           0          3  5,456.25

In [54]:
data['price']=data['price'].str.replace('$','').str.replace(',','')
data['price']

<ipython-input-54-036f1c94f32a>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  data['price']=data['price'].str.replace('$','').str.replace(',','')

dtype('O')

In [60]:
data['price']=pd.to_numeric(data['price']).astype(int)
data['price'].dtypes

dtype('int32')

## finally, i has comlete everything